Controllers/RecommendationController.php

    public function attemptLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'abelapriliani@example.com'
 LIMIT 1

    public function dashboard($preference)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('recommendation/login');
        }

        $destinationModel = new DestinationModel();
        $destinations = $destinationModel->where('category', $preference)->findAll();
---
SELECT *
FROM `destinations`
WHERE `category` = 'culture'

    public function destination($id)
    {
       if (!session()->get('isLoggedIn')) {
           return redirect()->to('recommendation/login');
       }

       $destinationModel = new DestinationModel();
       $destination = $destinationModel->find($id);
---
SELECT *
FROM `destinations`
WHERE `destinations`.`id` = '5'