app/Controllers/Auth.php

    public function createTestUser()
    {
        $userModel = new UserModel();

        // Check if user already exists
        $existingUser = $userModel->where('email', 'abelapriliani@example.com')->first();

        if ($existingUser) {
            // Update existing user
            $userModel->update($existingUser['id'], [
                'username' => 'abelapriliani',
                'password' => 'password123',
                'preference' => 'nature'
            ]);
---
SELECT *
FROM `users`
WHERE `email` = 'abelapriliani@example.com'
 LIMIT 1
UPDATE `users` SET `username` = 'abelapriliani', `password` = '$2y$10$BhPyLo9q.dCvrVf6Sp80pebiWuaEkwcJ7kNLtmY7g9AFSiyIFN7A.', `preference` = 'nature', `updated_at` = '2025-01-10 04:39:28'
WHERE `users`.`id` IN ('1')