app/Controllers/Tourism.php

SELECT *
FROM `routes`
SELECT *
FROM `destinations`
---
    public function index()
    {
        $routeModel = new RouteModel();
        $destinationModel = new DestinationModel();

        // Get preference from query string if available, otherwise from session
        $preference = $this->request->getGet('preference') ?? session()->get('preference');

        // Store preference in session if it came from query string
        if ($this->request->getGet('preference')) {
            session()->set('preference', $preference);
        }

        // Get distinct areas for the filter
        $areas = $routeModel->getDistinctAreas();

        $data = [
            'routes' => $routeModel->findAll(),
            'destinations' => $destinationModel->findAll(),
            'areas' => $areas,
            'preference' => $preference,
            'title' => 'Transportation Management'
        ];

SELECT *
FROM `destinations`
WHERE `destinations`.`id` = '6'
---
    public function destination($id)
    {
        $destinationModel = new DestinationModel();
        $destination = $destinationModel->find($id);

SELECT *
FROM `routes`
WHERE `routes`.`id` = '2'
SELECT *
FROM `transports`
---
    public function route($id)
    {
        $routeModel = new RouteModel();
        $transportModel = new TransportModel();

        $route = $routeModel->find($id);

        if (!$route) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $data = [
            'route' => $route,
            'transports' => $transportModel->findAll(),

SELECT *
FROM `routes`
WHERE `routes`.`id` = '2'
---
    public function schedule($id)
    {
        $scheduleModel = new ScheduleModel();
        $routeModel = new RouteModel();

        $route = $routeModel->find($id);