Models/DestinationModel.php

    public function getPopularDestinations()
    {
        return $this->orderBy('popularity', 'DESC')->findAll();
---
SELECT *
FROM `destinations`
ORDER BY `popularity` DESC