Models/RouteModel.php

SELECT *
FROM `routes`
WHERE `distance` <= ''
AND `area` = 'Lembang'
---
    public function getRoutesByFilter($distance = null, $area = null)
    {
        $builder = $this->db->table('routes');

        if ($distance !== null && $distance !== '') {
            $builder->where('distance <=', $distance);
        }

        if ($area !== null && $area !== '') {
            $builder->where('area', $area);
        }

        return $builder->get()->getResultArray();

SELECT DISTINCT(area) as area
FROM `routes`
ORDER BY `area` ASC
---
    public function getDistinctAreas()
    {
        return $this->select('DISTINCT(area) as area')
                    ->orderBy('area', 'ASC')
                    ->findAll();