Models/ScheduleModel.php

    public function getSchedulesWithTransport($routeId)
    {
        return $this->select('schedules.*, transports.type, transports.capacity')
                    ->join('transports', 'transports.id = schedules.transport_id')
                    ->where('route_id', $routeId)
                    ->findAll();
---
SELECT `schedules`.*, `transports`.`type`, `transports`.`capacity`
FROM `schedules`
JOIN `transports` ON `transports`.`id` = `schedules`.`transport_id`
WHERE `route_id` = '2'